content/_index.md
+++
title = "Home"
author = ["Jordan Herzstein"]
draft = false
+++

## Welcome to YortNet {#welcome-to-yortnet}

YortNet is created by myself ([Jordan Herzstein](https://jordanherzstein.com)) to host various services and privacy frontends at no cost for my own learning as well as the public good.


### Provided Services {#provided-services}

-   YortNet Minecraft Server: Private Minecraft server (invite only)
-   [SearXNG](https://searx.yortnet.com): An open metasearch engine
-   [Mozhi](https://mozhi.yortnet.com): Frontend for various translation engines
-   [PrivateBin](https://bin.yortnet.com): Pastebin alternative where the server has zero knowledge of pasted data
-   [GotHub](https://gothub.yortnet.com): Alternative lightweight GitHub frontend
-   [Forgejo](https://git.yortnet.com): An open source, self-hostable git server

More to come...


### Policies {#policies}

By accessing services provided by yortnet.com you agree to the terms below.

These policies are derived in part from <https://tux.pizza/tos/> and <https://bus-hit.me/#tos>.


#### Terms of Service {#terms-of-service}

The services are provided as is and is without warranties, neither expressed or implied.

In no event will the server operator of yortnet.com be liable to you or any third party for damages or other liability arising out of or in connection with the services provided by yortnet.com.


#### Privacy {#privacy}

The following is subject to change at any time.

I share none of your data with third parties, though by using these services you agree to some anonymized data collection.

Your data is accessed by NGINX access logs which contains your IP address with it's last octet anonymized (e.g. ip address 161.155.211.14 shows as 161.155.211.0 in the logs), a timestamp, site path, and User-Agent, which may contain browser information, operating system, etc. These logs are only kept internally on the linux server hosting these services running the NGINX reverse proxy and is never shared.

The server running this site and other services is located in Toronto, Canada, provided by Oracle Corporation. Read their privacy policy [here](https://www.oracle.com/legal/privacy/services-privacy-policy.html).
